import numpy as np
import pygame
from time import sleep


def midi2freq(midi_number):
  return 440 * 2 ** ((midi_number - 69) * (1./12.))



DISCR_FREQ = 44100
STEREO = 0

PRECALCULATED_SOUND_DURATION = 17

def note_freq(latin_note, octave_number=0, w0=261.626):
    """ Возвращает частоты ноты, заданную латинским названием (C, D, E, F, G, A или B)
        w0 - "опорная" частота, по умолчанию частота ноты до первой (в центре клавиатура пианино) октавы
        octave_number: 0 соответствует первой октаве, -1 - малой октаве, etc
    """
    notes = {"c": 1, "d": 3, "e": 5, "f":6, "g": 8, "a": 10, "b": 12}
    latin_note = latin_note.lower()
    assert latin_note in notes
    n = notes[latin_note]
    return w0 * 2 ** ((n - 1) / 12 ) * 2 ** (octave_number)


def note_on(midi_number):
    play_freq(midi2freq(midi_number), duration=1)    
    print(midi2freq(midi_number))


def play_precalculated_note(midi_number, volume=127):
    if len(precalculated_sound[midi_number]) > 0:
        if volume == 127:
            sound = pygame.sndarray.make_sound(precalculated_sound[midi_number])
            sound.play(maxtime=17000) # CONSTANT TO REMOVE!
        elif volume < 127:
            sound = pygame.sndarray.make_sound( ((volume / 127 ) * precalculated_sound[midi_number]).astype("uint16"))
            sound.play(maxtime=17000)  # CONSTANT TO REMOVE!



def precalculate_sounds(duration):
    print("Calculating sounds")
    DURATION = duration


    ARRAY_SIZE = int(DISCR_FREQ * DURATION * (STEREO + 1))

    t = np.linspace(0, DURATION, num=ARRAY_SIZE)

    precalculated_sounds = np.zeros(shape=[128, ARRAY_SIZE], dtype="int16")

    total_number_of_notes = precalculated_sounds.shape[0]

    max_amp = 0
    
    for note_number in range(total_number_of_notes):
        print("%d%%" %  round(100.0 * note_number / total_number_of_notes), end="", flush=True)
        NOTE_FREQ = midi2freq(note_number)

        x =  np.tan(t / 100) * np.exp(-t ** 3.1 + 1)* (np.sin( (NOTE_FREQ) * 2 * np.pi * t)
         + np.sin( (NOTE_FREQ) * 2 * np.pi * (t + 2/3))**3
         + 2 * np.sin(0.5 * NOTE_FREQ * 2*np.pi * t)
         + 0.21  * np.sin( 2 * NOTE_FREQ * 2*np.pi * t)
           + 0.3 * np.sin( 4 * NOTE_FREQ * 2*np.pi * t))


#        NOTE_FREQ  /= 2
#        x = np.exp(-t ** 1.1 + 1) * (np.sin(NOTE_FREQ * 2 * np.pi * t)
#           + 0.2 * np.sin(2 * NOTE_FREQ * 2*np.pi * t) 
#            + 0.02  * np.sin( 4 * NOTE_FREQ * 2*np.pi * t)
#            + 0.03 * np.sin( 8 * NOTE_FREQ * 2*np.pi * t))



        max_amp = np.max(np.abs(x))

        scaled = np.int16(x / max_amp * 20000.0)
        precalculated_sounds[note_number] = scaled
        print("\r", end="", flush=True)

    print("Ready!")
    return precalculated_sounds



# As an alternative, instead of generating sounds, here I read them from wav-files I recorded
def load_from_wavs(path="", *_):
    from scipy.io import wavfile

    notes_array = [[]] * 128
    for i in range(1, 60):
        wav_file = r"C:\Programming\Piano\Notes try\notes\%03d.wav" % i
        fs, data = wavfile.read(wav_file)
        notes_array[i + 35] = data

    return notes_array

pygame.mixer.pre_init(DISCR_FREQ, size=-16, channels=1)
pygame.mixer.init()
pygame.mixer.set_num_channels(100)



precalculated_sound = precalculate_sounds(duration=7)
#precalculated_sound = load_from_wavs()




l = [[50], [74], [76], [78], [69, 62], [78], [76], [74], [81, 54], [74], [76], [78], [69, 62], [78], [76], [74], [79, 52], [76], [78], [79], [71, 62], [74], [73], [71], [73, 57], [76], [78], [79], [69, 61], [79], [78], [76], [78, 50], [74], [76], [78], [69, 62], [73], [71], [69], [71, 50], [74], [76], [78], [71, 62], [81], [80], [78], [80, 50], [76], [78], [80], [71, 56], [74], [73], [71], [69, 49], [73], [74], [76], [66, 57], [76], [74], [73], [74, 47], [71], [73], [74], [66, 57], [69], [68], [66], [68, 52], [71], [73], [74], [64, 56], [74], [73], [71], [73, 45], [69], [71], [73], [64, 57], [67], [66], [64], [66, 45], [69], [71], [73], [66, 57], [76], [75], [73], [75, 45], [71], [73], [75], [66, 51], [69], [67], [66], [64, 43], [67], [69], [71], [61, 52], [74], [73], [71], [70, 42], [64], [66], [67], [61, 54], [67], [66], [64], [62, 42], [71], [73], [74], [66, 54], [69], [68], [66], [65, 42], [68], [69], [71], [65, 54], [74], [73], [71], [80, 42], [77], [78], [80], [73, 54], [83], [81], [80], [81, 42], [78], [80], [81], [73, 54], [76], [75], [73], [75, 47], [78], [79], [81], [71, 51], [81], [79], [78], [79, 40], [76], [78], [79], [71, 52], [74], [72], [71], [72, 40], [75], [76], [78], [69, 51], [72], [71], [69], [67, 40], [76], [78], [79], [71, 52], [74], [73], [71], [73, 45], [76], [78], [79], [69, 49], [79], [78], [76], [78, 38], [74], [76], [78], [69, 50], [72], [71], [69], [71, 38], [67], [69], [71], [61, 50], [71], [69], [67], [66, 38], [62], [64], [66], [57, 50], [60], [59], [57], [59, 38], [62], [64], [66], [59, 50], [69], [68], [66], [68, 38], [64], [66], [68], [59, 56], [62], [60], [59], [57, 48], [60], [62], [64], [57, 54], [67], [66], [64], [63, 47], [57], [59], [60], [57, 51], [60], [59], [57], [55, 52], [64], [66], [67], [59, 55], [62], [61], [59], [58, 47], [61], [62], [64], [58, 52], [67], [66], [64], [73, 55], [70], [71], [73], [66, 58], [76], [74], [73], [74, 47], [71], [73], [74], [66, 59], [69], [68], [66], [68, 52], [71], [72], [74], [64, 56], [74], [72], [71], [72, 45], [69], [71], [72], [64, 57], [67], [66], [64], [66, 50], [69], [71], [72], [62, 54], [72], [71], [69], [71, 43], [67], [69], [71], [62, 55], [71], [69], [67], [74, 47], [67], [69], [71], [62, 55], [71], [69], [67], [72, 45], [69], [71], [72], [64, 55], [67], [66], [64], [66, 50], [69], [71], [72], [62, 54], [72], [71], [69], [71, 43], [67], [69], [71], [62, 55], [66], [64], [62], [64, 43], [67], [69], [71], [64, 55], [74], [73], [71], [73, 43], [69], [71], [73], [64, 49], [67], [66], [64], [62, 42], [66], [67], [69], [59, 50], [69], [67], [66], [67, 40], [64], [66], [67], [59, 50], [62], [61], [59], [61, 45], [64], [66], [67], [57, 49], [67], [66], [64], [66, 38], [62], [64], [66], [57, 50], [66], [64], [62], [69, 42], [66], [67], [69], [62, 57], [72], [71], [69], [71, 43], [67], [69], [71], [62, 55], [71], [69], [67], [74, 47], [71], [73], [74], [68, 62], [77], [76], [74], [73, 45], [69], [71], [73], [64, 55], [67], [66], [64], [69, 54], [74], [76], [78], [71, 50], [81], [79], [78], [79, 52], [73], [74], [76], [69, 49], [79], [78], [76], [78, 50], [71], [73], [74], [68, 47], [78], [76], [74], [73], [67, 52], [69, 54], [70, 55], [64, 49], [67, 52], [65, 50], [64, 49], [65, 50], [74, 53], [76, 55], [77, 57], [73, 52], [76, 55], [74, 53], [73, 52], [74, 53], [82, 50], [81, 52], [79, 53], [77, 45], [76, 48], [74, 46], [73, 45], [74, 44], [77], [76], [74], [83], [80], [81], [83], [77], [74], [76], [77], [71], [68], [69], [71], [64], [66], [68], [69], [71], [73], [74], [76], [77, 45], [73], [74, 57], [69], [70, 55], [67], [76, 49], [67], [69, 53], [65], [74, 50], [65], [67, 52], [64], [73, 55], [64], [45], [50], [53], [56], [59], [62], [65], [68], [71], [74], [73], [71], [69], [68], [66], [64], [66], [68], [69], [71], [73], [74], [76], [77], [76], [74], [73], [71], [69], [68], [66], [64], [62], [61], [64], [67], [70], [73], [76], [79], [82], [62], [65], [68], [71], [74], [77], [80], [83], [69, 64, 74, 45, 52, 57], [73, 55], [74, 69, 66, 50, 57, 54]]



for chord in l:
    for note in chord:
        play_precalculated_note(note, 50)

    input("press enter ")
 